## Plan Result




<pre><code>Plan: 29 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_cosmosdb_account.cosmosdb
  * azurerm_cosmosdb_sql_container.container[&#34;cve-reports&#34;]
  * azurerm_cosmosdb_sql_container.container[&#34;performance-metrics&#34;]
  * azurerm_cosmosdb_sql_container.container[&#34;pipeline-metrics&#34;]
  * azurerm_cosmosdb_sql_database.sqlapidb
  * azurerm_key_vault.jenkinskv
  * azurerm_key_vault_secret.account_key
  * azurerm_key_vault_secret.db
  * azurerm_key_vault_secret.disk
  * azurerm_key_vault_secret.env_subscription_id[&#34;sbox&#34;]
  * azurerm_key_vault_secret.jenkins-agent-password
  * azurerm_key_vault_secret.subscription_id
  * azurerm_managed_disk.disk
  * azurerm_resource_group.rg
  * azurerm_role_assignment.dns_contributor
  * azurerm_role_assignment.hmctsacrpull
  * azurerm_role_assignment.imagegallery
  * azurerm_role_assignment.jenkinskvrole
  * azurerm_role_assignment.miroles
  * azurerm_role_assignment.subidcontributer[&#34;sbox&#34;]
  * azurerm_role_assignment.subiduseraccessadmin[&#34;sbox&#34;]
  * azurerm_storage_account.storage_account
  * azurerm_storage_container.artifacts
  * azurerm_storage_container.performance
  * azurerm_user_assigned_identity.usermi
  * random_password.jenkins-agent-password
  * random_password.jenkins-agent-password2
  * random_password.jenkins-agent-password3
  * random_password.jenkins-agent-password4



  
<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_cosmosdb_account.cosmosdb will be created
  + resource "azurerm_cosmosdb_account" "cosmosdb" {
      + access_key_metadata_writes_enabled    = true
      + analytical_storage_enabled            = false
      + connection_strings                    = (sensitive value)
      + create_mode                           = (known after apply)
      + default_identity_type                 = "FirstPartyIdentity"
      + enable_automatic_failover             = true
      + enable_free_tier                      = false
      + enable_multiple_write_locations       = false
      + endpoint                              = (known after apply)
      + id                                    = (known after apply)
      + is_virtual_network_filter_enabled     = false
      + kind                                  = "GlobalDocumentDB"
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + mongo_server_version                  = (known after apply)
      + name                                  = "sds-jenkins-pipeline-metrics-sbox"
      + network_acl_bypass_for_azure_services = false
      + offer_type                            = "Standard"
      + primary_key                           = (sensitive value)
      + primary_master_key                    = (sensitive value)
      + primary_readonly_key                  = (sensitive value)
      + primary_readonly_master_key           = (sensitive value)
      + public_network_access_enabled         = true
      + read_endpoints                        = (known after apply)
      + resource_group_name                   = "sds-jenkins-ptlsbox-rg"
      + secondary_key                         = (sensitive value)
      + secondary_master_key                  = (sensitive value)
      + secondary_readonly_key                = (sensitive value)
      + secondary_readonly_master_key         = (sensitive value)
      + tags                                  = {
          + "application"  = "core"
          + "builtFrom"    = "abcd"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + write_endpoints                       = (known after apply)

      + analytical_storage {
          + schema_type = (known after apply)
        }

      + backup {
          + interval_in_minutes = (known after apply)
          + retention_in_hours  = (known after apply)
          + storage_redundancy  = (known after apply)
          + type                = (known after apply)
        }

      + capabilities {
          + name = (known after apply)
        }

      + capacity {
          + total_throughput_limit = (known after apply)
        }

      + consistency_policy {
          + consistency_level       = "Session"
          + max_interval_in_seconds = (known after apply)
          + max_staleness_prefix    = (known after apply)
        }

      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "ukwest"
          + zone_redundant    = false
        }
      + geo_location {
          + failover_priority = 1
          + id                = (known after apply)
          + location          = "uksouth"
          + zone_redundant    = true
        }
    }

  # azurerm_cosmosdb_sql_container.container["cve-reports"] will be created
  + resource "azurerm_cosmosdb_sql_container" "container" {
      + account_name          = "sds-jenkins-pipeline-metrics-sbox"
      + database_name         = "jenkins"
      + default_ttl           = (known after apply)
      + id                    = (known after apply)
      + name                  = "cve-reports"
      + partition_key_path    = "/build/git_url"
      + partition_key_version = 2
      + resource_group_name   = "sds-jenkins-ptlsbox-rg"
      + throughput            = (known after apply)

      + autoscale_settings {
          + max_throughput = 4000
        }

      + conflict_resolution_policy {
          + conflict_resolution_path      = (known after apply)
          + conflict_resolution_procedure = (known after apply)
          + mode                          = (known after apply)
        }

      + indexing_policy {
          + indexing_mode = "Consistent"

          + excluded_path {
              + path = (known after apply)
            }

          + included_path {
              + path = (known after apply)
            }
        }
    }

  # azurerm_cosmosdb_sql_container.container["performance-metrics"] will be created
  + resource "azurerm_cosmosdb_sql_container" "container" {
      + account_name          = "sds-jenkins-pipeline-metrics-sbox"
      + database_name         = "jenkins"
      + default_ttl           = (known after apply)
      + id                    = (known after apply)
      + name                  = "performance-metrics"
      + partition_key_path    = "/_partitionKey"
      + partition_key_version = 2
      + resource_group_name   = "sds-jenkins-ptlsbox-rg"
      + throughput            = (known after apply)

      + autoscale_settings {
          + max_throughput = 4000
        }

      + conflict_resolution_policy {
          + conflict_resolution_path      = (known after apply)
          + conflict_resolution_procedure = (known after apply)
          + mode                          = (known after apply)
        }

      + indexing_policy {
          + indexing_mode = "Consistent"

          + excluded_path {
              + path = (known after apply)
            }

          + included_path {
              + path = (known after apply)
            }
        }
    }

  # azurerm_cosmosdb_sql_container.container["pipeline-metrics"] will be created
  + resource "azurerm_cosmosdb_sql_container" "container" {
      + account_name          = "sds-jenkins-pipeline-metrics-sbox"
      + database_name         = "jenkins"
      + default_ttl           = (known after apply)
      + id                    = (known after apply)
      + name                  = "pipeline-metrics"
      + partition_key_path    = "/_partitionKey"
      + partition_key_version = 2
      + resource_group_name   = "sds-jenkins-ptlsbox-rg"
      + throughput            = (known after apply)

      + autoscale_settings {
          + max_throughput = 4000
        }

      + conflict_resolution_policy {
          + conflict_resolution_path      = (known after apply)
          + conflict_resolution_procedure = (known after apply)
          + mode                          = (known after apply)
        }

      + indexing_policy {
          + indexing_mode = "Consistent"

          + excluded_path {
              + path = (known after apply)
            }

          + included_path {
              + path = (known after apply)
            }
        }
    }

  # azurerm_cosmosdb_sql_database.sqlapidb will be created
  + resource "azurerm_cosmosdb_sql_database" "sqlapidb" {
      + account_name        = "sds-jenkins-pipeline-metrics-sbox"
      + id                  = (known after apply)
      + name                = "jenkins"
      + resource_group_name = "sds-jenkins-ptlsbox-rg"
      + throughput          = (known after apply)

      + autoscale_settings {
          + max_throughput = 4000
        }
    }

  # azurerm_key_vault.jenkinskv will be created
  + resource "azurerm_key_vault" "jenkinskv" {
      + access_policy              = (known after apply)
      + enable_rbac_authorization  = true
      + id                         = (known after apply)
      + location                   = "uksouth"
      + name                       = "ptlsbox"
      + resource_group_name        = "sds-jenkins-ptlsbox-rg"
      + sku_name                   = "standard"
      + soft_delete_enabled        = (known after apply)
      + soft_delete_retention_days = 7
      + tags                       = {
          + "application"  = "core"
          + "builtFrom"    = "abcd"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + tenant_id                  = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                  = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # azurerm_key_vault_secret.account_key will be created
  + resource "azurerm_key_vault_secret" "account_key" {
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = "buildlog-storage-account"
      + tags           = {
          + "username" = "sdsjenkinsafactptlsbox"
        }
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.db will be created
  + resource "azurerm_key_vault_secret" "db" {
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = "cosmosdb-token-key"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.disk will be created
  + resource "azurerm_key_vault_secret" "disk" {
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = "jenkins-disk-id"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.env_subscription_id["sbox"] will be created
  + resource "azurerm_key_vault_secret" "env_subscription_id" {
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = "sbox-subscription-id"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.jenkins-agent-password will be created
  + resource "azurerm_key_vault_secret" "jenkins-agent-password" {
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = "jenkins-agent-password"
      + tags           = {
          + "foo"  = "foobar"
          + "hi"   = "hello"
          + "roo"  = "ruby"
          + "test" = "testing"
        }
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.subscription_id will be created
  + resource "azurerm_key_vault_secret" "subscription_id" {
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = "subscription-id"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_managed_disk.disk will be created
  + resource "azurerm_managed_disk" "disk" {
      + create_option                 = "Empty"
      + disk_iops_read_only           = (known after apply)
      + disk_iops_read_write          = (known after apply)
      + disk_mbps_read_only           = (known after apply)
      + disk_mbps_read_write          = (known after apply)
      + disk_size_gb                  = 1024
      + id                            = (known after apply)
      + location                      = "uksouth"
      + logical_sector_size           = (known after apply)
      + max_shares                    = (known after apply)
      + name                          = "sds-jenkins-ptlsbox-disk"
      + public_network_access_enabled = true
      + resource_group_name           = "disks-ptlsbox-rg"
      + source_uri                    = (known after apply)
      + storage_account_type          = "Premium_LRS"
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "abcd"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + tier                          = (known after apply)
      + zones                         = [
          + "1",
        ]
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "sds-jenkins-ptlsbox-rg"
      + tags     = {
          + "application"  = "core"
          + "builtFrom"    = "abcd"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
    }

  # azurerm_role_assignment.dns_contributor will be created
  + resource "azurerm_role_assignment" "dns_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Private DNS Zone Contributor"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.hmctsacrpull will be created
  + resource "azurerm_role_assignment" "hmctsacrpull" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.imagegallery will be created
  + resource "azurerm_role_assignment" "imagegallery" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/galleries/hmcts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.jenkinskvrole will be created
  + resource "azurerm_role_assignment" "jenkinskvrole" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.miroles will be created
  + resource "azurerm_role_assignment" "miroles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.subidcontributer["sbox"] will be created
  + resource "azurerm_role_assignment" "subidcontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.subiduseraccessadmin["sbox"] will be created
  + resource "azurerm_role_assignment" "subiduseraccessadmin" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_storage_account.storage_account will be created
  + resource "azurerm_storage_account" "storage_account" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "ZRS"
      + account_tier                      = "Standard"
      + allow_blob_public_access          = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_0"
      + name                              = "sdsjenkinsafactptlsbox"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "sds-jenkins-ptlsbox-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "application"  = "core"
          + "builtFrom"    = "abcd"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = true

          + delete_retention_policy {
              + days = 14
            }
        }

      + customer_managed_key {
          + key_vault_key_id          = (known after apply)
          + user_assigned_identity_id = (known after apply)
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # azurerm_storage_container.artifacts will be created
  + resource "azurerm_storage_container" "artifacts" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "artifacts"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "sdsjenkinsafactptlsbox"
    }

  # azurerm_storage_container.performance will be created
  + resource "azurerm_storage_container" "performance" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "performance"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "sdsjenkinsafactptlsbox"
    }

  # azurerm_user_assigned_identity.usermi will be created
  + resource "azurerm_user_assigned_identity" "usermi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "jenkins-ptlsbox-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-ptlsbox-rg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "abcd"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + tenant_id           = (known after apply)
    }

  # random_password.jenkins-agent-password will be created
  + resource "random_password" "jenkins-agent-password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # random_password.jenkins-agent-password2 will be created
  + resource "random_password" "jenkins-agent-password2" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # random_password.jenkins-agent-password3 will be created
  + resource "random_password" "jenkins-agent-password3" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # random_password.jenkins-agent-password4 will be created
  + resource "random_password" "jenkins-agent-password4" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 29 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":40,"Program":"tfcmt","SHA1":"","Vars":{}} -->